Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_SwiftUI/project_save.tmx
Source language: en_us
Languages: ja

source: Specifies a block to call when the corresponding property is not present in the user info dictionary.
ja: あるブロックを指定して、対応するプロパティがユーザ情報辞書において提示されない時に呼び出します。

source: Specifies a system font to use, along with the style, weight, and any design parameters you want applied to the text.
ja: 使用するシステムフォントを指定します、あなたがテキストに適用されることを望むスタイル、ウェイト、そしてあらゆるデザインパラメータも一緒に。

source: Specifies a transaction for the binding.
ja: あるトランザクションをバインディングに対して指定します。

source: Specifies an animation to perform when the binding value changes.
ja: あるアニメーションをそのバインドしている値が変化する時に実行するよう指定します。

source: Specifies if the view is focusable and, if so, adds an action to perform when the view comes into focus.
ja: ビューがフォーカス可能であるならば指定しますそして、もしそうならば、ビューがフォーカスに入る時に実行するアクションを加えます。

source: Specifies the direction of an arrow key movement.
ja: 矢印キーの動きの方向を指定します。

source: Specifies the point where activations occur in a view that’s an accessibility element.
ja: アクセシビリティ要素であるビューにおいて、アクティベーションが発生するところの点を指定します。

source: Specifies the point where activations occur in the view.
ja: アクティベーションがビューの中で発生するところの地点を指定します。

source: Specifies the unit point where activations occur in a view that’s an accessibility element.
ja: アクセシビリティ要素であるビューにおいて、アクティベーションが発生するところの単位点を指定します。

source: Specifies the unit point where activations occur in the view.
ja: アクティベーションがビューの中で発生するところの単位点を指定します。

source: Specifies whether to hide this view from system accessibility features.
ja: このビューをシステムアクセシビリティ機能から隠すべきかどうかを指定します。

source: Specify a drop delegate when you modify a view to accept drops with the onDrop(of:delegate:) method.
ja: あなたがあるビューをドロップを受け入れるように修正する時はonDrop(of:delegate:)メソッドでドロップ委任先を指定してください。

source: Specify a style that conforms to ButtonStyle when creating a button that uses the standard button interaction behavior defined for each platform.
ja: ButtonStyleに準拠するスタイルを指定してください、各プラットホームに対して定義される標準ボタン相互作用挙動を使うボタンを作成する場合は。

source: Specify a style that conforms to PrimitiveButtonStyle to create a button with custom interaction behavior.
ja: PrimitiveButtonStyleに準拠するスタイルを指定することで、あつらえの相互作用挙動をもつボタンを作成してください。

source: Specify the expected types when you apply the drop modifier to the view.
ja: あなたがドロップ修飾子をビューに適用する時に、期待する型を指定してください。

source: Specifying Interpolation
ja: 補間を指定する

source: Specifying a Resizing Mode
ja: リサイズモードを指定する

source: Specifying a Scale
ja: 縮尺を指定する

source: Specifying an Adjustment Direction
ja: 調節方向を指定する

source: Specifying the Button Type
ja: ボタン型を指定する

source: Specifying the Truncation Mode
ja: 切り詰めモードを指定する

source: Standard Command Groups
ja: 標準コマンドグループ

source: Standard placement for commands related to printing app content.
ja: アプリ内容の印刷に関連したコマンドそれらの標準配置。

source: Standard placement for commands that create and open different kinds of documents.
ja: 異なる種類の書類を作成および開くコマンドそれらの標準配置。

source: Standard placement for commands that interact with the pasteboard and manipulate content that is currently selected in the app’s view hierarchy.
ja: ペーストボードと相互作用するそしてアプリのビュー階層において現在選択される内容を操作するコマンドそれらの標準配置。

source: Standard placement for commands that result in app termination.
ja: アプリ終了という結果になるコマンドそれらの標準配置。

source: Standard placement for commands that save open documents and close windows.
ja: 開いた書類を保存するそしてウインドウを閉じるコマンドそれらの標準配置。

source: Starts the event-driven parsing operation.
ja: イベント駆動構文解析演算を開始します。

source: State
ja: 状態

source: State and Data Flow
ja: 状態とデータフロー

source: Stops the parser object.
ja: パーサーオブジェクトを停止します。

source: Streams, Sockets, and Ports
ja: ストリーム、ソケット、およびポート

source: Strings and Text
ja: 文字列とテキスト

source: Strings in Swift conform to the Comparable protocol, so the names are sorted in ascending order according to the less-than operator (<).
ja: 文字列はSwift ではComparableプロトコルに準拠します、それでこれらの名前はより小さい演算子（<）によって昇順にソートされます。

source: Structures
ja: 構造体

source: Styling
ja: スタイリング

source: Styling Buttons
ja: ボタンのスタイルを指定する

source: Styling Date Pickers
ja: 日付ピッカーのスタイルを決める

source: Styling Images
ja: 画像にスタイルをつける

source: Styling Pickers
ja: ピッカーのスタイルを決める

source: Styling Specific View Types
ja: 特定のビュー型にスタイルをつける

source: Styling Text Fields
ja: テキストフィールドのスタイルを決める

source: Styling Views
ja: ビューにスタイルをつける

source: Styling a Button
ja: ボタンの様式を整える

source: Styling a Font
ja: フォントのスタイリング

source: Styling a Menu Button
ja: メニューボタンの様式を整える

source: Styling a Toggle
ja: トグルの体裁を整える

source: Styling the View’s Text
ja: ビューのもつテキストにスタイルをつける

source: Subclasses of NSObject can customize Equatable conformance by overriding isEqual(_:).
ja: NSObjectのサブクラスは、Equatable準拠をカスタマイズすることがisEqual(_:)をオーバーライドすることによって可能です。

source: Subclassing Notes
ja: サブクラス作成の注意

source: Subscripts
ja: 添え字

source: Subsequent attempts raise an error.
ja: その後の試みはエラーを引き起こします。

source: Subtracts the second value from the first and stores the difference in the left-hand-side variable.
ja: ２番目の値を最初のものから減じて、その差を左手側の変数の中に格納します。

source: Supply actions for a view to perform in response to user input and system events.
ja: アクションをビューに提供して、ユーザ入力とシステムイベントに応答して実行します。

source: Support drag and drop operations.
ja: ドラッグドロップ操作をサポートします。

source: Supporting Accessibility Text Weights
ja: アクセシビリティテキストウェイトをサポートする

source: Supporting Drag and Drop in Views
ja: ドラッグアンドドロップをビューにおいてサポートする

source: Supporting Types
ja: 支援を行う型

source: Suspends execution of the receiver task.
ja: レシーバタスクの遂行を一時停止します。

source: Swift Standard Library
ja: Swif標準ライブラリ

source: SwiftUI calls this function before rending a view’s body to ensure the view has the most recent fetched results.
ja: SwiftUIは、この関数をビューのもつbodyを描出する前に呼び出して、ビューが最新の取って来た結果を持つことを確実にします。

source: SwiftUI calls this function before rending a view’s body to ensure the view has the most recent value.
ja: SwiftUIは、この関数をビューのもつbodyを描画する前に呼び出して、ビューが最新の値を持つことを確実にします。

source: SwiftUI calls this method before adding the hosting controller's root view to the view hierarchy.
ja: SwiftUIは、ホスティングコントローラのもつルートビューをビュー階層へと加える前に、このメソッドを呼び出します。

source: SwiftUI calls this method before calling the makeNSView(context:) method.
ja: SwiftUIはこのメソッドを、makeNSView(context:)メソッドを呼び出す前に呼び出します。

source: SwiftUI calls this method before calling the makeNSViewController(context:) method.
ja: SwiftUIはこのメソッドを、makeNSViewController(context:)メソッドを呼び出す前に呼び出します。

source: SwiftUI calls this method before calling the makeUIView(context:) method.
ja: SwiftUIはこのメソッドを、makeUIView(context:)メソッドを呼び出す前に呼び出します。

source: SwiftUI calls this method before calling the makeUIViewController(context:) method.
ja: SwiftUIはこのメソッドを、makeUIViewController(context:)メソッドを呼び出す前に呼び出します。

source: SwiftUI calls this method before calling the makeWKInterfaceObject(context:) method.
ja: SwiftUIはこのメソッドを、makeWKInterfaceObject(context:)メソッドを呼び出す前に呼び出します。

source: SwiftUI calls this method for any changes affecting the corresponding AppKit view controller.
ja: SwiftUIは、このメソッドを、対応するAppKitビューコントローラに影響を及ぼすあらゆる変化に対して呼び出します。

source: SwiftUI calls this method for any changes affecting the corresponding AppKit view.
ja: SwiftUIは、このメソッドを、対応するAppKitビューに影響を及ぼすあらゆる変化に対して呼び出します。

source: SwiftUI calls this method for any changes affecting the corresponding UIKit view.
ja: SwiftUIは、このメソッドを、対応するUIKitビューに影響を及ぼすあらゆる変化に対して呼び出します。

source: SwiftUI calls this method for any changes affecting the corresponding interface object.
ja: SwiftUIは、このメソッドを、対応するインターフェイスオブジェクトに影響を及ぼすあらゆる変化に対して呼び出します。

source: SwiftUI calls this method immediately before computing the view’s body.
ja: SwiftUIは、ビューのもつbodyを計算する直前にこのメソッドを呼び出します。

source: SwiftUI doesn't invoke the updating callback when the user ends or cancels a gesture.
ja: SwiftUIは、ユーザがジェスチャを終えるまたはとり消す時に、更新コールバックを発動しません。

source: SwiftUI doesn’t call the init(_:) method when you initialize a text view with a string literal as the input.
ja: SwiftUIは、init(_:)メソッドを呼び出しません、あなたがテキストビューをその入力として文字列リテラルで初期化する場合は。

source: SwiftUI doesn’t invoke the updating callback when the user ends or cancels a gesture.
ja: SwiftUIは、ユーザがジェスチャを終えるまたはとり消す時に、更新コールバックを発動しません。

source: SwiftUI gives precedence to the first gesture.
ja: SwiftUIは、優先順位を最初のジェスチャに与えます。

source: SwiftUI handles all the complexity of these combined, overlapping, and interruptible animations for you.
ja: SwiftUIは、組み合わされた、オーバーラップしている、そして中断可能なアニメーションの複雑さの全てをあなたの代わりに取り扱います。

source: SwiftUI invokes the updating callback as soon as it recognizes the gesture and whenever the value of the gesture changes.
ja: SwiftUIは、それがジェスチャを認識するとすぐにそしてジェスチュの値が変化する時はいつでも更新コールバックを発動します。

source: SwiftUI is a modern way to declare user interfaces for any Apple platform.
ja: SwiftUIは、ユーザインターフェイスをあらゆるAppleプラットホームに対して宣言するためのモダンな方法です。

source: SwiftUI manages the storage of any property you declare as a state.
ja: SwiftUIは、あなたがある状態として宣言するあらゆるプロパティのストレージを管理します。

source: SwiftUI only invokes the onEnded(_:) callback when the gesture succeeds.
ja: SwiftUIは、onEnded(_:)コールバックをジェスチャが成功する時に発動するだけです。

source: SwiftUI passes a set of indices to the closure that’s relative to the dynamic view’s underlying collection of data.
ja: SwiftUIは、一揃いのインデックスをクロージャに渡します、それは動的ビューのもつ基礎をなすデータのコレクションに関するものです。

source: SwiftUI passes anchored geometry values around the view tree via preference keys.
ja: SwiftUIは、アンカー幾何学値をビューツリーのあちこちに参照キー経由で渡します。

source: SwiftUI provides views, controls, and layout structures for declaring your app's user interface.
ja: SwiftUIは、ビュー、コントロール、そしてレイアウト構造体を、あなたのアプリのユーザインターフェイスを宣言するために提供します。

source: SwiftUI provides views, controls, and layout structures for declaring your app’s user interface.
ja: SwiftUIは、ビュー、コントロール、そしてレイアウト構造体を、あなたのアプリのユーザインターフェイスを宣言するために提供します。

source: SwiftUI renders forms in a manner appropriate for the platform.
ja: SwiftUIは、フォームをそのプラットホームに適した流儀で描出します。

source: SwiftUI uses this value to shrink text that doesn’t fit in a view when it’s okay to shrink the text.
ja: SwiftUIは、この値を使うことでビューの中に収まらないテキストを縮めます、それがテキストを縮めるのが支障ない場合は。

source: SwiftUI works seamlessly with the existing UI frameworks on all Apple platforms.
ja: SwiftUIは、継ぎ目なく既存のUIフレームワークと全てのAppleプラットホーム上で作業します。

source: System Actions
ja: システムアクション

source: Tab views only support tab items of type Text, Image, or an image followed by text.
ja: タブビューが唯一サポートするタブ項目は、型Text、Image、またはテキストが続く画像です。

source: Task Termination Handler
ja: タスク終止ハンドラ

source: Tasks and Pipes
ja: タスクとパイプ

source: Tell a view how to arrange itself within a view hierarchy by adjusting its size, position, alignment, padding, and so on.
ja: ビューにどのようにそれ自身をビュー階層内で整えるか伝えます、それの大きさ、位置、整列、詰め、その他を調整することによって。

source: Tells the delegate a validated drop has entered the modified view.
ja: 委任先に、ある有効なドロップがその修正されたビューに入れられたところだと伝えます。

source: Tells the delegate a validated drop has entered the onDrop modified view.
ja: 委任先に、ある有効なドロップがonDrop修正されたビューに入れられたところだと伝えます。

source: Tells the delegate a validated drop operation has exited the modified view.
ja: 委任先に、ある有効なドロップ操作がその修正されたビューを出たところだと伝えます。

source: Tells the delegate a validated drop operation has exited the onDrop modified view.
ja: 委任先に、ある有効なドロップ操作がonDrop修正されたビューを出たところだと伝えます。

source: Tells the delegate it can request the item provider data from the given information.
ja: 委任先にそれがこの与えられた情報からアイテムプロバイダデータを要請できると伝えます。

source: Tells the delegate that a drop containing items conforming to one of the expected types entered a view that accepts drops.
ja: 委任先に、その予想された型の１つに準拠している項目を含んでいるあるドロップが、ドロップを受け取るビューに入ったことを伝えます。

source: Tells the delegate that a validated drop moved inside the modified view.
ja: 委任先に、ある有効なドロップがその修正されたビュー内に移動したと伝えます。

source: Testing For Membership
ja: メンバーシップに対してテストする

source: Testing for Membership
ja: 帰属をテストする

source: Text
ja: テキスト

source: Text Field Styles
ja: テキストフィールドスタイル

source: Text that uses the font weight you specify.
ja: あなたが指定するフォントウェイトを使うテキスト。

source: Text that uses the font you specify.
ja: あなたが指定するフォントを使うテキスト。

source: Text that’s above or below its baseline.
ja: それのベースラインより上または下にあるテキスト。

source: Text with a line running along its baseline.
ja: それのベースラインに沿って延びている線を持つテキスト。

source: Text with a line through its center.
ja: それの中心を貫く線を持つテキスト。

source: Text with the specified amount of kerning.
ja: 指定された量のカーニングをもつテキスト。

source: Text with the specified amount of tracking.
ja: 指定された量のトラッキングをもつテキスト。

source: That is, for any elements a, b, and c, the following conditions must hold:
ja: すなわち、何らかの要素a、b、そしてcに対して、以下の条件が保持されなければなりません：

source: That is, of the two lobes of the symbol, one lobe is complete and the other is half complete.
ja: すなわち、記号の２つの丸い突出部のうち、一方の丸突出部は完全です、そして他方は半分完全です。

source: The DropDelegate protocol provides a comprehensive and flexible way to interact with a drop operation.
ja: DropDelegateプロトコルは、ドロップ操作と相互作用する包括的で柔軟な方法を提供します。

source: The ExclusiveGesture gives presedence to its first gesture.
ja: ExclusiveGestureは、優先順位をそれの最初のジェスチャに与えます。

source: The View protocol provides a large set of modifiers, defined as protocol methods with default implementations, that you use to position and configure views in the layout of your app.
ja: Viewプロトコルは、省略時の実装を備えるプロトコルメソッドとして定義される、広範なひとそろいの修飾子を提供します、それはあなたが使用してあなたのアプリのレイアウトにおいてビューの位置を定めたり構成設定をするものです。

source: The action closure’s parameter contains the final value of the gesture.
ja: actionクロージャのもつパラメータは、ジェスチャの最終の値を含みます。

source: The action closure’s parameter contains the gesture’s new value.
ja: actionクロージャのもつパラメータは、ジェスチャのもつ新しい値を含みます。

source: The colorInvert() modifier inverts all of the colors in a view so that each color displays as its complementary color.
ja: colorInvert()修飾子は、ビューの中の色の全てを反転します、それで各色はそれの補色として表示されます。

source: The luminanceToAlpha() modifier creates a semitransparent mask out of the view you apply it to.
ja: luminanceToAlpha()修飾子は、あなたがそれを適用するビューの外に半透明マスクを作成します。

source: The nextPartialResult closure is called sequentially with an accumulating value initialized to initialResult and each element of the sequence.
ja: nextPartialResultクロージャはinitialResultに初期化された蓄積値およびシーケンスの各要素とともに連続して呼び出されます。

source: The nextPartialResult closure is called with initialResult—0 in this case—and the first element of numbers, returning the sum: 1.
ja: nextPartialResultクロージャが、initialResult—この場合では0とnumbersの最初の要素とともに呼び出されて、その合計：1を返します。

source: The shape fills the view’s frame, while maintaining its aspect ratio.
ja: shapeはビューのもつ枠を埋め尽くします、と同時にそれのアスペクト比を保ちます。

source: The updateAccumulatingResult closure is called sequentially with a mutable accumulating value initialized to initialResult and each element of the sequence.
ja: updateAccumulatingResultクロージャは、initialResultに初期化された可変の蓄積値とシーケンスの各要素とともに連続して呼び出されます。

source: The updateAccumulatingResult closure is called with the initial accumulating value—[:] in this case—and the first character of letters, modifying the accumulating value by setting 1 for the key "a".
ja: updateAccumulatingResultクロージャが、初期蓄積値—この場合では[:]—およびlettersの最初の文字とともに呼び出されて、1をキー"a"に対して設定することで蓄積値を修正します。

source: The @avg array operator.
ja: @avg配列演算子。

source: The @count array operator.
ja: @count配列演算子。

source: The @distinctUnionOfArrays array operator.
ja: @distinctUnionOfArrays配列演算子。

source: The @distinctUnionOfObjects array operator.
ja: @distinctUnionOfObjects配列演算子。

source: The @distinctUnionOfSets array operator.
ja: @distinctUnionOfSets配列演算子。

source: The @max array operator.
ja: @max配列演算子。

source: The @min array operator.
ja: @min配列演算子。

source: The @sum array operator.
ja: @sum配列演算子。

source: The @unionOfArrays array operator.
ja: @unionOfArrays配列演算子。

source: The @unionOfObjects array operator.
ja: @unionOfObjects配列演算子。

source: The @unionOfSets array operator.
ja: @unionOfSets配列演算子。

source: The circle view has an attached DragGesture that targets the enclosing VStack’s coordinate space.
ja: circleビューは、添付されたDragGestureを持ちます、それはまわりを囲んでいるVStackのもつ座標空間を目標としています。

source: The x, y and z elements that specify the axis of rotation.
ja: x、yそしてz要素、それらは回転の軸を指定します。

source: The action closure passes the new value as its parameter.
ja: actionクロージャは、新しい値をそれのパラメータとして渡します。

source: The gestureState parameter is the previous state of the gesture, and the transaction is the context of the gesture.
ja: gestureStateパラメータは、ジェスチャの直前の状態です、そしてtransactionはジェスチャの前後関係です。

source: The ffl letter combination keeps a constant shape as the other letters move together or apart.
ja: ffl文字組み合わせは、ある一定の形状を、他の文字が一緒になったり離れたりするときに保ちます。

source: The XMLDocument class is thread-safe as long as any given instance is used only in one thread.
ja: XMLDocumentクラスは、スレッド安全です、どんなインスタンスであれ１つのスレッドの中でのみ使われる限りは。

source: The Boolean parameter to onFocusChange is true when the view is in focus; otherwise, it’s false.
ja: onFocusChangeへのブールのパラメータは、ビューがフォーカスにある時はtrueです；そうでなければ、それはfalseです。

source: The Caps Lock key.
ja: Caps Lockキー。

source: The Command key.
ja: Commandキー。

source: The Control key.
ja: Controlキー。

source: The Function key.
ja: Functionキー。

source: The Option key.
ja: Optionキー。

source: The Shift key.
ja: Shiftキー。

source: The Touch Bar view is visible by default and cannot be removed during customization.
ja: Touch Barビューは初期状態で可視です、そしてカスタマイゼーションの間に取り除かれることができません。

source: The Touch Bar view is visible by default, but can be removed during customization.
ja: Touch Barビューは、初期状態では可視です、しかしカスタマイゼーションの間に取り除かれることができます。

source: The Touch Bar view isn’t visible by default, but appears in the customization palette.
ja: Touch Barビューは初期状態で可視ではありません、しかしカスタマイゼーションパレットにおいて現れます。

source: The accessed slice uses the same indices for the same elements as the original collection uses.
ja: アクセスされるスライス（切片）は、同じ要素に対して元のコレクションが使うのと同じインデックスを使います。

source: The accessed slice uses the same indices for the same elements as the original collection.
ja: アクセスされるスライス（切片）は、同じ要素に対して元のコレクションと同じインデックスを使います。

source: The action is either a method or closure property that does something when a user clicks or taps the button.
ja: アクションは、あるメソッドまたはクロージャプロパティのどちらかです、それはユーザがボタンをクリックまたはタップする時に何かを行うものです。

source: The action that you want SwiftUI to perform when elements in the view are deleted.
ja: ビューの中の要素が削除される時にあなたがSwiftUIに実行してほしいアクション。

source: The action to perform when self is triggered.
ja: selfが作動させられる時に実行するアクション。

source: The action to perform when the user triggers the button.
ja: ユーザがボタンを作動させる場合に実行するアクション。

source: The action to perform when the value for key changes.
ja: keyに対する値が変化する時に実行するアクション。

source: The action to perform when this gesture ends.
ja: このジェスチャが終わる時に実行するアクション。

source: The action to perform when this gesture’s value changes.
ja: このジェスチャのもつ値が変化する時に実行するアクション。

source: The action to perform whenever the pointer enters or exits this view’s frame.
ja: ポインタがこのビューのフレームに入るまたは出る時はいつでも実行するアクション。

source: The action to perform.
ja: 実行するアクション。

source: The affine transformation matrix to apply to this shape.
ja: この形状に適用するアフィン変換行列。

source: The algorithm used to select a random element may change in a future version of Swift.
ja: ある無作為の要素を選ぶのに使われるアルゴリズムは、Swiftの将来のバージョンで変わるかもしれません。

source: The algorithm used to shuffle a sequence may change in a future version of Swift.
ja: シーケンスをシャッフルするのに使われるアルゴリズムは、Swiftの将来のバージョンで変わるかもしれません。

source: The alignment for overlay in relation to the view.
ja: overlayに対する整列、ビューに対する関係において。

source: The alignment of this view inside the resulting frame.
ja: 結果フレーム内でのこのビューの整列。

source: The alignment of this view inside the resulting view.
ja: 結果ビュー内でのこのビューの整列。

source: The alignment on the horizontal axis.
ja: 水平軸上の整列。

source: The alignment on the vertical axis.
ja: 垂直軸状の整列。

source: The alternate end quotation symbol associated with the locale.
ja: そのロケールと関連した代替終わり引用記号。

source: The alternating begin quotation symbol associated with the locale.
ja: そのロケールと関連した代替の始まり引用記号。

source: The amount of Digital Crown rotation needed to move between two integer numbers.
ja: ２つの整数の間を移動するために必要とされるDigital Crown回転の量。

source: The amount of additional space, in points, that the view should add to each character cluster after layout.
ja: 追加的空間の量、ポイントで、それはビューが各文字クラスタにレイアウトの後に加えるべきものです。

source: The amount of saturation to apply to this view.
ja: このビューに適用する彩度の量。

source: The amount of space between the bottom of one line and the top of the next line.
ja: １つの行の下面と次の行の上面の間の空きの量。

source: The amount to inset this view on each edge.
ja: このビューに各縁上で差し込む量。

source: The amount to shift the text vertically (up or down) relative to its baseline.
ja: テキストをそれのベースラインに相対して垂直（上や下）に移す量。

source: The amount, in points, by which you offset the shape.
ja: 分量、ポイントで、それだけあなたは形状を位置埋め合わせします。

source: The angle at which to rotate the view.
ja: それでこのビューを回転する角度。

source: The angle of rotation to apply.
ja: 適用する回転角度。

source: The angle of the rotation gesture.
ja: 回転ジェスチャの角度。

source: The animation applies to all child views within this view; calling animation(_:) on a container view can lead to unbounded scope.
ja: アニメーションは、このビュー内のすべての子ビューに適用されます；animation(_:)をコンテナビュー上で呼び出すことは、無制限スコープに至る可能性があります。

source: The animation style to use when hiding or showing the status bar for this view controller.
ja: このビューコントローラに対するステータスバーを隠すまたは表示する時に使うアニメーションスタイル。

source: The animation to apply to animatable values within this view.
ja: このビュー内のアニメーション可能な値に適用するアニメーション。

source: The animation to apply.
ja: 適用するアニメーション。

source: The animation to perform when the current state changes
ja: 現在の状態が変化する時に実行するアニメーション。

source: The animation, if any, associated with the current state change.
ja: もしあれば、現在の状態変化と結びつけられたアニメーション。

source: The appearance and interaction of Slider is determined at runtime and can be customized.
ja: Sliderの外観と相互作用は、実行時に決定されます、そしてカスタマイズ可能です。

source: The appearance and interaction of Stepper is determined at runtime and can be customized.
ja: Stepperの外観と相互作用は、実行時に決定されます、そしてカスタマイズ可能です。

source: The appearance and interaction of Toggle is determined at runtime and can be customized.
ja: Toggleの外観と相互作用は、実行時に決定されます、そしてカスタマイズ可能です。

source: The array of color stops.
ja: 色経由それらからなる配列。

source: The associated type representing the data type of the environment key's value.
ja: 環境キーのもつ値のデータ型を表している関連型。

source: The attachment of context menu is controlled by the Boolean value shouldShowMenu which is true, enabling the contextual menu.
ja: コンテキストメニューの添付は、ブール値shouldShowMenuによって制御され、それはtrueであり、コンテキストによるメニューを許可しています。

source: The attributes of a drag gesture.
ja: あるドラッグジェスチャの属性。

source: The attributes of the performed gesture.
ja: 実行されたジェスチャの属性。

source: The base state.
ja: 基準状態。

source: The begin quotation symbol associated with the locale.
ja: そのロケールと関連した始まり引用記号。

source: The behavior of a drop.
ja: あるドロップの挙動。

source: The binding’s transaction.
ja: バインディングのもつトランザクション。

source: The binding’s value is true when the cursor is inside the area, and false when the cursor is outside.
ja: バインディングのもつ値は、カーソルが領域内にあるならばtrue、そしてカーソルが外側にあるならばfalseです。

source: The blend mode for compositing this view.
ja: このビューを合成するためのブレンドモード。

source: The border style.
ja: 境界線スタイル。

source: The bounds of the range must be valid indices of the collection.
ja: この範囲の境界は、コレクションの有効なインデックスでなければなりません。

source: The bounds of the view expand to contain the moved text.
ja: ビューの境界は、移動されたテキストを含むように拡張されます。

source: The bundle containing the strings file.
ja: 文字列ファイルを含んでいるバンドル。

source: The bundle in which to search for the nib file.
ja: それの中でnibファイルを検索することになるバンドル。

source: The calendar associated with the locale.
ja: そのロケールと関連したカレンダー。

source: The callback that SwiftUI invokes as the gesture’s value changes.
ja: SwiftUIがそのジェスチャのもつ値が変化するにつれて発動するコールバック。

source: The change dictionary contains an NSKeyValueChangeNotificationIsPriorKey entry whose value is an NSNumber object that contains the Boolean value YES.
ja: 変更辞書は、NSKeyValueChangeNotificationIsPriorKey登録項目を含みます、それの値はあるNSNumberオブジェクトで、それはブール値YESを含みます。

source: The change dictionary contains an notificationIsPriorKey entry whose value is an NSNumber object that contains the Boolean value true.
ja: 変更辞書は、notificationIsPriorKey登録項目を含みます、それの値はあるNSNumberオブジェクトで、それはブール値trueを含みます。

source: The character position at which the receiver will begin its next scanning operation.
ja: この文字位置で、レシーバはそれの次のスキャン操作を開始するでしょう。
